Revit 2024 API
RevitAPIEventArgs Members
The RevitAPIEventArgs type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RevitAPIEventArgs
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace